# student_grade = [
#     "序号",
#     1,
#     "姓名",
#     "王静文",
#     "科目",
#     "语文",
#     "成绩",
#     90,
#     "序号",
#     2,
#     "姓名",
#     "王静文",
#     "科目",
#     "数学",
#     "成绩",
#     85,
#     "序号",
#     3,
#     "姓名",
#     "王静文",
#     "科目",
#     "英语",
#     "成绩",
#     76,
#     "序号",
#     4,
#     "姓名",
#     "康力",
#     "科目",
#     "语文",
#     "成绩",
#     50,
#     "序号",
#     5,
#     "姓名",
#     "康力",
#     "科目",
#     "数学",
#     "成绩",
#     99,
#     "序号",
#     6,
#     "姓名",
#     "康力",
#     "科目",
#     "英语",
#     "成绩",
#     78,
#     "序号",
#     7,
#     "姓名",
#     "刘聪",
#     "科目",
#     "语文",
#     "成绩",
#     86,
#     "序号",
#     8,
#     "姓名",
#     "刘聪",
#     "科目",
#     "数学",
#     "成绩",
#     74,
#     "序号",
#     9,
#     "姓名",
#     "刘聪",
#     "科目",
#     "英语",
#     "成绩",
#     90,
# ]

# pass

# # 王静文同学的语文成绩(列表中下标为7的元素)
# student_grade[7]
# # 王静文的数学成绩
# student_grade[15]
# # 王静文的英语成绩
# student_grade[23]


# 使用字典存储数据
wjw_chinese = {"序号": 1, "姓名": "王静文", "科目": "语文", "成绩": 90}
wjw_math = {"序号": 2, "姓名": "王静文", "科目": "数学", "成绩": 85}
wjw_english = {"序号": 3, "姓名": "王静文", "科目": "英语", "成绩": 76}
kangli_chinese = {"序号": 4, "姓名": "康力", "科目": "语文", "成绩": 50}
kangli_math = {"序号": 5, "姓名": "康力", "科目": "数学", "成绩": 99}
kangli_english = {"序号": 6, "姓名": "康力", "科目": "英语", "成绩": 78}
liucong_chinese = {"序号": 7, "姓名": "刘聪", "科目": "语文", "成绩": 86}
liucong_math = {"序号": 8, "姓名": "刘聪", "科目": "数学", "成绩": 74}
liucong_english = {"序号": 9, "姓名": "刘聪", "科目": "英语", "成绩": 90}

# 王静文同学的语文成绩
wjw_chinese["成绩"]
wjw_math["成绩"]
wjw_english["成绩"]
